//====================================================================================================================
//====================================================================================================================
// src/config/character.initialStats.config.js
// 캐릭터 초기 스탯 설정값
//====================================================================================================================
//====================================================================================================================
const characterStatsInitialValues = {
    Warrior: { hp: 600, mp: 100, level: 1, attack: 16, defense: 15 },
    Rogue: { hp: 350, mp: 150, level: 1, attack: 28, defense: 5 },
    Druid: { hp: 500, mp: 200, level: 1, attack: 20, defense: 10 },
    Warlock: { hp: 400, mp: 300, level: 1, attack: 25, defense: 8 },
    Hunter: { hp: 500, mp: 150, level: 1, attack: 22, defense: 12 },
};

export default characterStatsInitialValues;
